GoodbyeGalaxy/ESP32-S3-touch_LVGL-9/studio-panel/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# 16 MB Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# 8 MB PSRAM (OPI/Octal)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# FreeRTOS 1 kHz Tick
CONFIG_FREERTOS_HZ=1000

# Watchdog aus (erleichtert Debug)
CONFIG_ESP_TASK_WDT_EN=n

# LVGL Fonts (werden in Phase 1 erweitert)
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_14=y

# WiFi (Phase 3)
CONFIG_ESP_WIFI_SSID="MeinNetzwerk"
CONFIG_ESP_WIFI_PASSWORD="MeinPasswort"
CONFIG_ESP_WIFI_AUTH_WPA2_PSK=y

# lwIP sockets
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_UDP_RECVMBOX_SIZE=16

# Increase socket buffer for UDP
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5744
